#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.git_net_1.netbox_vlan.vlan: Refreshing state... [id=2]
module.git_net_2.netbox_vlan.vlan: Refreshing state... [id=3]
module.git_net_2.netbox_prefix.prefix: Refreshing state... [id=2]
module.git_net_1.netbox_prefix.prefix: Refreshing state... [id=1]
module.tenant_policies.data.aci_tenant.common: Reading...
module.git_net_1.aci_bridge_domain.github_project: Refreshing state... [id=uni/tn-github_project/BD-vlan_15_bd]
module.git_net_1.aci_epgs_using_function.epg_to_aep_assign: Refreshing state... [id=uni/infra/attentp-github_project/gen-default/rsfuncToEpg-[uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg]]
module.git_net_2.aci_subnet.subnet: Refreshing state... [id=uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg/subnet-[192.168.16.1/24]]
module.common.aci_vlan_pool.github_project: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static]
module.git_net_1.aci_application_profile.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap]
module.common.aci_ranges.vlan_2_50_range: Refreshing state... [id=uni/infra/vlanns-[github_project_pool]-static/from-[vlan-2]-to-[vlan-50]]
module.git_net_1.aci_epg_to_domain.net_2_domain: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg/rsdomAtt-[uni/phys-github_project]]
module.git_net_1.aci_application_epg.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg]
module.git_net_2.aci_application_epg.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg]
module.git_net_1.aci_subnet.subnet: Refreshing state... [id=uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg/subnet-[192.168.15.1/24]]
module.tenant_policies.data.aci_tenant.common: Read complete after 1s [id=uni/tn-common]
module.common.aci_attachable_access_entity_profile.github_project: Refreshing state... [id=uni/infra/attentp-github_project]
module.git_net_2.aci_bridge_domain.github_project: Refreshing state... [id=uni/tn-github_project/BD-vlan_16_bd]
module.common.aci_physical_domain.github_project: Refreshing state... [id=uni/phys-github_project]
module.git_net_2.aci_application_profile.github_project: Refreshing state... [id=uni/tn-github_project/ap-git_net_2_ap]
module.git_net_2.aci_epgs_using_function.epg_to_aep_assign: Refreshing state... [id=uni/infra/attentp-github_project/gen-default/rsfuncToEpg-[uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg]]
module.common.aci_vrf.github_project: Refreshing state... [id=uni/tn-github_project/ctx-github_project]
module.common.aci_tenant.github_project: Refreshing state... [id=uni/tn-github_project]
module.common.aci_access_generic.epg_to_aep: Refreshing state... [id=uni/infra/attentp-github_project/gen-default]
module.git_net_2.aci_epg_to_domain.net_2_domain: Refreshing state... [id=uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg/rsdomAtt-[uni/phys-github_project]]
module.devvie_project_1.data.aci_tenant.common: Reading...
module.devvie_project_1.data.aci_tenant.common: Read complete after 0s [id=uni/tn-common]
module.git_net_2.fmc_network_objects.aci_net: Refreshing state... [id=005056BF-7B88-0ed3-0000-012886512707]
module.git_net_1.fmc_network_objects.aci_net: Refreshing state... [id=005056BF-7B88-0ed3-0000-012886512689]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.common.aci_access_generic.epg_to_aep will be destroyed
  # (because aci_access_generic.epg_to_aep is not in configuration)
  - resource "aci_access_generic" "epg_to_aep" {
      - annotation                          = "orchestrator:terraform" -> null
      - attachable_access_entity_profile_dn = "uni/infra/attentp-github_project" -> null
      - id                                  = "uni/infra/attentp-github_project/gen-default" -> null
      - name                                = "default" -> null
    }

  # module.common.aci_attachable_access_entity_profile.github_project will be destroyed
  # (because aci_attachable_access_entity_profile.github_project is not in configuration)
  - resource "aci_attachable_access_entity_profile" "github_project" {
      - annotation              = "orchestrator:terraform" -> null
      - id                      = "uni/infra/attentp-github_project" -> null
      - name                    = "github_project" -> null
      - relation_infra_rs_dom_p = [
          - "uni/phys-github_project",
        ] -> null
    }

  # module.common.aci_physical_domain.github_project will be destroyed
  # (because aci_physical_domain.github_project is not in configuration)
  - resource "aci_physical_domain" "github_project" {
      - annotation                    = "orchestrator:terraform" -> null
      - id                            = "uni/phys-github_project" -> null
      - name                          = "github_project" -> null
      - relation_infra_rs_vlan_ns     = "uni/infra/vlanns-[github_project_pool]-static" -> null
      - relation_infra_rs_vlan_ns_def = "uni/infra/vlanns-[github_project_pool]-static" -> null
    }

  # module.common.aci_ranges.vlan_2_50_range will be destroyed
  # (because aci_ranges.vlan_2_50_range is not in configuration)
  - resource "aci_ranges" "vlan_2_50_range" {
      - alloc_mode   = "static" -> null
      - annotation   = "orchestrator:terraform" -> null
      - from         = "vlan-2" -> null
      - id           = "uni/infra/vlanns-[github_project_pool]-static/from-[vlan-2]-to-[vlan-50]" -> null
      - role         = "external" -> null
      - to           = "vlan-50" -> null
      - vlan_pool_dn = "uni/infra/vlanns-[github_project_pool]-static" -> null
    }

  # module.common.aci_tenant.github_project will be destroyed
  # (because aci_tenant.github_project is not in configuration)
  - resource "aci_tenant" "github_project" {
      - annotation  = "orchestrator:terraform" -> null
      - description = "Tenant for github_project" -> null
      - id          = "uni/tn-github_project" -> null
      - name        = "github_project" -> null
    }

  # module.common.aci_vlan_pool.github_project will be destroyed
  # (because aci_vlan_pool.github_project is not in configuration)
  - resource "aci_vlan_pool" "github_project" {
      - alloc_mode = "static" -> null
      - annotation = "orchestrator:terraform" -> null
      - id         = "uni/infra/vlanns-[github_project_pool]-static" -> null
      - name       = "github_project_pool" -> null
    }

  # module.common.aci_vrf.github_project will be destroyed
  # (because aci_vrf.github_project is not in configuration)
  - resource "aci_vrf" "github_project" {
      - annotation             = "orchestrator:terraform" -> null
      - bd_enforced_enable     = "no" -> null
      - description            = "VRF for github_project" -> null
      - id                     = "uni/tn-github_project/ctx-github_project" -> null
      - ip_data_plane_learning = "enabled" -> null
      - knw_mcast_act          = "permit" -> null
      - name                   = "github_project" -> null
      - pc_enf_dir             = "ingress" -> null
      - pc_enf_pref            = "enforced" -> null
      - tenant_dn              = "uni/tn-github_project" -> null
    }

  # module.devvie_project_1.aci_application_epg.devvie_application_epg will be created
  + resource "aci_application_epg" "devvie_application_epg" {
      + annotation                  = "tag_epg"
      + application_profile_dn      = (known after apply)
      + description                 = "EPG for devvie_project_1"
      + exception_tag               = "0"
      + flood_on_encap              = "disabled"
      + fwd_ctrl                    = (known after apply)
      + has_mcast_source            = "no"
      + id                          = (known after apply)
      + is_attr_based_epg           = "no"
      + match_t                     = "AtleastOne"
      + name                        = "devvie_project_1_epg"
      + name_alias                  = (known after apply)
      + pc_enf_pref                 = "unenforced"
      + pref_gr_memb                = "exclude"
      + prio                        = "unspecified"
      + relation_fv_rs_bd           = (known after apply)
      + relation_fv_rs_cust_qos_pol = (known after apply)
      + shutdown                    = "no"
    }

  # module.devvie_project_1.aci_application_profile.devvie_app_profile will be created
  + resource "aci_application_profile" "devvie_app_profile" {
      + annotation                = "orchestrator:terraform"
      + description               = "devvie_project_1 ap"
      + id                        = (known after apply)
      + name                      = "devvie_project_1_ap"
      + name_alias                = (known after apply)
      + prio                      = (known after apply)
      + relation_fv_rs_ap_mon_pol = (known after apply)
      + tenant_dn                 = (known after apply)
    }

  # module.devvie_project_1.aci_bridge_domain.devvie_bridge_domain will be created
  + resource "aci_bridge_domain" "devvie_bridge_domain" {
      + annotation                  = "tag_bd"
      + arp_flood                   = "yes"
      + bridge_domain_type          = "regular"
      + description                 = "Bridge Domain for devvie_project_1"
      + ep_clear                    = "no"
      + ep_move_detect_mode         = (known after apply)
      + host_based_routing          = "no"
      + id                          = (known after apply)
      + intersite_bum_traffic_allow = "yes"
      + intersite_l2_stretch        = "yes"
      + ip_learning                 = "yes"
      + ipv6_mcast_allow            = (known after apply)
      + limit_ip_learn_to_subnets   = "yes"
      + ll_addr                     = (known after apply)
      + mac                         = (known after apply)
      + mcast_allow                 = "no"
      + multi_dst_pkt_act           = "bd-flood"
      + name                        = "vlan_15_bd"
      + name_alias                  = (known after apply)
      + optimize_wan_bandwidth      = "no"
      + relation_fv_rs_bd_to_ep_ret = (known after apply)
      + relation_fv_rs_bd_to_nd_p   = (known after apply)
      + relation_fv_rs_ctx          = (known after apply)
      + relation_fv_rs_igmpsn       = (known after apply)
      + relation_fv_rs_mldsn        = (known after apply)
      + tenant_dn                   = (known after apply)
      + unicast_route               = (known after apply)
      + unk_mac_ucast_act           = "proxy"
      + unk_mcast_act               = "flood"
      + v6unk_mcast_act             = (known after apply)
      + vmac                        = "not-applicable"
    }

  # module.devvie_project_1.aci_epg_to_contract.provided_contract will be created
  + resource "aci_epg_to_contract" "provided_contract" {
      + annotation         = "orchestrator:terraform"
      + application_epg_dn = (known after apply)
      + contract_dn        = (known after apply)
      + contract_type      = "provider"
      + id                 = (known after apply)
      + match_t            = (known after apply)
      + prio               = (known after apply)
    }

  # module.devvie_project_1.aci_epg_to_domain.net_2_domain will be created
  + resource "aci_epg_to_domain" "net_2_domain" {
      + allow_micro_seg       = (known after apply)
      + annotation            = "orchestrator:terraform"
      + application_epg_dn    = (known after apply)
      + binding_type          = (known after apply)
      + custom_epg_name       = (known after apply)
      + delimiter             = (known after apply)
      + encap                 = (known after apply)
      + encap_mode            = (known after apply)
      + epg_cos               = (known after apply)
      + epg_cos_pref          = (known after apply)
      + id                    = (known after apply)
      + instr_imedcy          = (known after apply)
      + lag_policy_name       = (known after apply)
      + netflow_dir           = (known after apply)
      + netflow_pref          = (known after apply)
      + num_ports             = (known after apply)
      + port_allocation       = (known after apply)
      + primary_encap         = (known after apply)
      + primary_encap_inner   = (known after apply)
      + res_imedcy            = (known after apply)
      + secondary_encap_inner = (known after apply)
      + switching_mode        = (known after apply)
      + tdn                   = (known after apply)
      + vmm_allow_promiscuous = (known after apply)
      + vmm_forged_transmits  = (known after apply)
      + vmm_id                = (known after apply)
      + vmm_mac_changes       = (known after apply)
    }

  # module.devvie_project_1.aci_epgs_using_function.epg_to_aep_assign will be created
  + resource "aci_epgs_using_function" "epg_to_aep_assign" {
      + access_generic_dn = (known after apply)
      + annotation        = "orchestrator:terraform"
      + encap             = "vlan-15"
      + id                = (known after apply)
      + instr_imedcy      = (known after apply)
      + mode              = "regular"
      + primary_encap     = (known after apply)
      + tdn               = (known after apply)
    }

  # module.devvie_project_1.aci_subnet.subnet will be created
  + resource "aci_subnet" "subnet" {
      + annotation  = "orchestrator:terraform"
      + ctrl        = (known after apply)
      + description = "This subnet is created by terraform"
      + id          = (known after apply)
      + ip          = "192.168.15.1/24"
      + name_alias  = (known after apply)
      + parent_dn   = (known after apply)
      + preferred   = "no"
      + scope       = [
          + "public",
          + "shared",
        ]
      + virtual     = (known after apply)
    }

  # module.devvie_project_1.fmc_network_objects.aci_net will be created
  + resource "fmc_network_objects" "aci_net" {
      + id    = (known after apply)
      + name  = "devvie_project_1"
      + type  = (known after apply)
      + value = "192.168.15.0/24"
    }

  # module.devvie_project_1.netbox_prefix.prefix will be created
  + resource "netbox_prefix" "prefix" {
      + id      = (known after apply)
      + prefix  = "192.168.15.0/24"
      + status  = "active"
      + vlan_id = (known after apply)
    }

  # module.devvie_project_1.netbox_vlan.vlan will be created
  + resource "netbox_vlan" "vlan" {
      + id     = (known after apply)
      + name   = "devvie_project_1"
      + status = "active"
      + vid    = 15
    }

  # module.fabric_policies.aci_access_generic.epg_to_aep will be created
  + resource "aci_access_generic" "epg_to_aep" {
      + annotation                          = "orchestrator:terraform"
      + attachable_access_entity_profile_dn = (known after apply)
      + description                         = (known after apply)
      + id                                  = (known after apply)
      + name                                = "default"
      + name_alias                          = (known after apply)
    }

  # module.fabric_policies.aci_attachable_access_entity_profile.devvie_aaep will be created
  + resource "aci_attachable_access_entity_profile" "devvie_aaep" {
      + annotation              = "orchestrator:terraform"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "aaep_devvie"
      + name_alias              = (known after apply)
      + relation_infra_rs_dom_p = (known after apply)
    }

  # module.fabric_policies.aci_cdp_interface_policy.cdp_policy will be created
  + resource "aci_cdp_interface_policy" "cdp_policy" {
      + admin_st    = "enabled"
      + annotation  = "orchestrator:terraform"
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "cdp_policy"
      + name_alias  = (known after apply)
    }

  # module.fabric_policies.aci_fabric_if_pol.if_policy will be created
  + resource "aci_fabric_if_pol" "if_policy" {
      + annotation    = "orchestrator:terraform"
      + auto_neg      = "on"
      + description   = (known after apply)
      + fec_mode      = "inherit"
      + id            = (known after apply)
      + link_debounce = "100"
      + name          = "link_level_auto"
      + name_alias    = (known after apply)
      + speed         = "inherit"
    }

  # module.fabric_policies.aci_lacp_policy.lacp_policy will be created
  + resource "aci_lacp_policy" "lacp_policy" {
      + annotation  = "orchestrator:terraform"
      + ctrl        = [
          + "fast-sel-hot-stdby",
          + "graceful-conv",
          + "susp-individual",
        ]
      + description = (known after apply)
      + id          = (known after apply)
      + max_links   = "16"
      + min_links   = "1"
      + mode        = "active"
      + name        = "lacp_policy_active"
      + name_alias  = (known after apply)
    }

  # module.fabric_policies.aci_leaf_access_bundle_policy_group.devvie["VPC_DEVVIE_1"] will be created
  + resource "aci_leaf_access_bundle_policy_group" "devvie" {
      + annotation                               = "orchestrator:terraform"
      + description                              = (known after apply)
      + id                                       = (known after apply)
      + lag_t                                    = "node"
      + name                                     = "VPC_DEVVIE_1"
      + name_alias                               = (known after apply)
      + relation_infra_rs_att_ent_p              = "uni/infra/attentp-aaep_devvie"
      + relation_infra_rs_cdp_if_pol             = (known after apply)
      + relation_infra_rs_copp_if_pol            = (known after apply)
      + relation_infra_rs_fc_if_pol              = (known after apply)
      + relation_infra_rs_h_if_pol               = (known after apply)
      + relation_infra_rs_l2_if_pol              = (known after apply)
      + relation_infra_rs_l2_port_auth_pol       = (known after apply)
      + relation_infra_rs_l2_port_security_pol   = (known after apply)
      + relation_infra_rs_lacp_pol               = (known after apply)
      + relation_infra_rs_lldp_if_pol            = (known after apply)
      + relation_infra_rs_macsec_if_pol          = (known after apply)
      + relation_infra_rs_mcp_if_pol             = (known after apply)
      + relation_infra_rs_mon_if_infra_pol       = (known after apply)
      + relation_infra_rs_qos_dpp_if_pol         = (known after apply)
      + relation_infra_rs_qos_egress_dpp_if_pol  = (known after apply)
      + relation_infra_rs_qos_ingress_dpp_if_pol = (known after apply)
      + relation_infra_rs_qos_pfc_if_pol         = (known after apply)
      + relation_infra_rs_qos_sd_if_pol          = (known after apply)
      + relation_infra_rs_stormctrl_if_pol       = (known after apply)
      + relation_infra_rs_stp_if_pol             = (known after apply)
    }

  # module.fabric_policies.aci_leaf_access_bundle_policy_group.devvie["VPC_DEVVIE_2"] will be created
  + resource "aci_leaf_access_bundle_policy_group" "devvie" {
      + annotation                               = "orchestrator:terraform"
      + description                              = (known after apply)
      + id                                       = (known after apply)
      + lag_t                                    = "node"
      + name                                     = "VPC_DEVVIE_2"
      + name_alias                               = (known after apply)
      + relation_infra_rs_att_ent_p              = "uni/infra/attentp-aaep_devvie"
      + relation_infra_rs_cdp_if_pol             = (known after apply)
      + relation_infra_rs_copp_if_pol            = (known after apply)
      + relation_infra_rs_fc_if_pol              = (known after apply)
      + relation_infra_rs_h_if_pol               = (known after apply)
      + relation_infra_rs_l2_if_pol              = (known after apply)
      + relation_infra_rs_l2_port_auth_pol       = (known after apply)
      + relation_infra_rs_l2_port_security_pol   = (known after apply)
      + relation_infra_rs_lacp_pol               = (known after apply)
      + relation_infra_rs_lldp_if_pol            = (known after apply)
      + relation_infra_rs_macsec_if_pol          = (known after apply)
      + relation_infra_rs_mcp_if_pol             = (known after apply)
      + relation_infra_rs_mon_if_infra_pol       = (known after apply)
      + relation_infra_rs_qos_dpp_if_pol         = (known after apply)
      + relation_infra_rs_qos_egress_dpp_if_pol  = (known after apply)
      + relation_infra_rs_qos_ingress_dpp_if_pol = (known after apply)
      + relation_infra_rs_qos_pfc_if_pol         = (known after apply)
      + relation_infra_rs_qos_sd_if_pol          = (known after apply)
      + relation_infra_rs_stormctrl_if_pol       = (known after apply)
      + relation_infra_rs_stp_if_pol             = (known after apply)
    }

  # module.fabric_policies.aci_lldp_interface_policy.lldp_policy will be created
  + resource "aci_lldp_interface_policy" "lldp_policy" {
      + admin_rx_st = "enabled"
      + admin_tx_st = "enabled"
      + annotation  = "orchestrator:terraform"
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "lldp_policy"
      + name_alias  = (known after apply)
    }

  # module.fabric_policies.aci_miscabling_protocol_interface_policy.mcp_policy will be created
  + resource "aci_miscabling_protocol_interface_policy" "mcp_policy" {
      + admin_st    = "enabled"
      + annotation  = "orchestrator:terraform"
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "mcp_policy"
      + name_alias  = (known after apply)
    }

  # module.fabric_policies.aci_physical_domain.devvie_physdom will be created
  + resource "aci_physical_domain" "devvie_physdom" {
      + annotation                         = "orchestrator:terraform"
      + id                                 = (known after apply)
      + name                               = "physdom_devvie"
      + name_alias                         = (known after apply)
      + relation_infra_rs_dom_vxlan_ns_def = (known after apply)
      + relation_infra_rs_vlan_ns          = (known after apply)
      + relation_infra_rs_vlan_ns_def      = (known after apply)
    }

  # module.fabric_policies.aci_ranges.vlan_2_50_range will be created
  + resource "aci_ranges" "vlan_2_50_range" {
      + alloc_mode   = "static"
      + annotation   = "orchestrator:terraform"
      + description  = (known after apply)
      + from         = "vlan-2"
      + id           = (known after apply)
      + name_alias   = (known after apply)
      + role         = (known after apply)
      + to           = "vlan-50"
      + vlan_pool_dn = (known after apply)
    }

  # module.fabric_policies.aci_vlan_pool.devvie_vlan_pool will be created
  + resource "aci_vlan_pool" "devvie_vlan_pool" {
      + alloc_mode  = "static"
      + annotation  = "orchestrator:terraform"
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "devvie_vlan_pool"
      + name_alias  = (known after apply)
    }

  # module.git_net_1.aci_application_epg.github_project will be destroyed
  # (because aci_application_epg.github_project is not in configuration)
  - resource "aci_application_epg" "github_project" {
      - annotation             = "tag_epg" -> null
      - application_profile_dn = "uni/tn-github_project/ap-git_net_1_ap" -> null
      - description            = "EPG for git_net_1" -> null
      - exception_tag          = "0" -> null
      - flood_on_encap         = "disabled" -> null
      - fwd_ctrl               = "none" -> null
      - has_mcast_source       = "no" -> null
      - id                     = "uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg" -> null
      - is_attr_based_epg      = "no" -> null
      - match_t                = "AtleastOne" -> null
      - name                   = "git_net_1_epg" -> null
      - pc_enf_pref            = "unenforced" -> null
      - pref_gr_memb           = "exclude" -> null
      - prio                   = "unspecified" -> null
      - relation_fv_rs_bd      = "uni/tn-github_project/BD-vlan_15_bd" -> null
      - shutdown               = "no" -> null
    }

  # module.git_net_1.aci_application_profile.github_project will be destroyed
  # (because aci_application_profile.github_project is not in configuration)
  - resource "aci_application_profile" "github_project" {
      - annotation  = "orchestrator:terraform" -> null
      - description = "git_net_1 ap" -> null
      - id          = "uni/tn-github_project/ap-git_net_1_ap" -> null
      - name        = "git_net_1_ap" -> null
      - prio        = "unspecified" -> null
      - tenant_dn   = "uni/tn-github_project" -> null
    }

  # module.git_net_1.aci_bridge_domain.github_project will be destroyed
  # (because aci_bridge_domain.github_project is not in configuration)
  - resource "aci_bridge_domain" "github_project" {
      - annotation                  = "tag_bd" -> null
      - arp_flood                   = "yes" -> null
      - bridge_domain_type          = "regular" -> null
      - description                 = "Bridge Domain for git_net_1" -> null
      - ep_clear                    = "no" -> null
      - ep_move_detect_mode         = "disable" -> null
      - host_based_routing          = "no" -> null
      - id                          = "uni/tn-github_project/BD-vlan_15_bd" -> null
      - intersite_bum_traffic_allow = "yes" -> null
      - intersite_l2_stretch        = "yes" -> null
      - ip_learning                 = "yes" -> null
      - ipv6_mcast_allow            = "no" -> null
      - limit_ip_learn_to_subnets   = "yes" -> null
      - ll_addr                     = "::" -> null
      - mac                         = "00:22:BD:F8:19:FF" -> null
      - mcast_allow                 = "no" -> null
      - multi_dst_pkt_act           = "bd-flood" -> null
      - name                        = "vlan_15_bd" -> null
      - optimize_wan_bandwidth      = "no" -> null
      - relation_fv_rs_ctx          = "uni/tn-github_project/ctx-github_project" -> null
      - tenant_dn                   = "uni/tn-github_project" -> null
      - unicast_route               = "yes" -> null
      - unk_mac_ucast_act           = "proxy" -> null
      - unk_mcast_act               = "flood" -> null
      - v6unk_mcast_act             = "flood" -> null
      - vmac                        = "not-applicable" -> null
    }

  # module.git_net_1.aci_epg_to_domain.net_2_domain will be destroyed
  # (because aci_epg_to_domain.net_2_domain is not in configuration)
  - resource "aci_epg_to_domain" "net_2_domain" {
      - allow_micro_seg       = false -> null
      - annotation            = "orchestrator:terraform" -> null
      - application_epg_dn    = "uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg" -> null
      - binding_type          = "none" -> null
      - encap                 = "unknown" -> null
      - encap_mode            = "auto" -> null
      - epg_cos               = "Cos0" -> null
      - epg_cos_pref          = "disabled" -> null
      - id                    = "uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg/rsdomAtt-[uni/phys-github_project]" -> null
      - instr_imedcy          = "lazy" -> null
      - netflow_dir           = "both" -> null
      - netflow_pref          = "disabled" -> null
      - num_ports             = "0" -> null
      - port_allocation       = "none" -> null
      - primary_encap         = "unknown" -> null
      - primary_encap_inner   = "unknown" -> null
      - res_imedcy            = "lazy" -> null
      - secondary_encap_inner = "unknown" -> null
      - switching_mode        = "native" -> null
      - tdn                   = "uni/phys-github_project" -> null
      - vmm_id                = jsonencode({}) -> null
    }

  # module.git_net_1.aci_epgs_using_function.epg_to_aep_assign will be destroyed
  # (because aci_epgs_using_function.epg_to_aep_assign is not in configuration)
  - resource "aci_epgs_using_function" "epg_to_aep_assign" {
      - access_generic_dn = "uni/infra/attentp-github_project/gen-default" -> null
      - annotation        = "orchestrator:terraform" -> null
      - encap             = "vlan-15" -> null
      - id                = "uni/infra/attentp-github_project/gen-default/rsfuncToEpg-[uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg]" -> null
      - instr_imedcy      = "lazy" -> null
      - mode              = "regular" -> null
      - primary_encap     = "unknown" -> null
      - tdn               = "uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg" -> null
    }

  # module.git_net_1.aci_subnet.subnet will be destroyed
  # (because aci_subnet.subnet is not in configuration)
  - resource "aci_subnet" "subnet" {
      - annotation  = "orchestrator:terraform" -> null
      - ctrl        = [
          - "nd",
        ] -> null
      - description = "This subnet is created by terraform" -> null
      - id          = "uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg/subnet-[192.168.15.1/24]" -> null
      - ip          = "192.168.15.1/24" -> null
      - parent_dn   = "uni/tn-github_project/ap-git_net_1_ap/epg-git_net_1_epg" -> null
      - preferred   = "no" -> null
      - scope       = [
          - "public",
          - "shared",
        ] -> null
      - virtual     = "no" -> null
    }

  # module.git_net_1.fmc_network_objects.aci_net will be destroyed
  # (because fmc_network_objects.aci_net is not in configuration)
  - resource "fmc_network_objects" "aci_net" {
      - description = " " -> null
      - id          = "005056BF-7B88-0ed3-0000-012886512689" -> null
      - name        = "git_net_1" -> null
      - type        = "Network" -> null
      - value       = "192.168.15.0/24" -> null
    }

  # module.git_net_1.netbox_prefix.prefix will be destroyed
  # (because netbox_prefix.prefix is not in configuration)
  - resource "netbox_prefix" "prefix" {
      - id            = "1" -> null
      - is_pool       = false -> null
      - mark_utilized = false -> null
      - prefix        = "192.168.15.0/24" -> null
      - role_id       = 0 -> null
      - site_id       = 0 -> null
      - status        = "active" -> null
      - tags          = [] -> null
      - tenant_id     = 0 -> null
      - vlan_id       = 2 -> null
      - vrf_id        = 0 -> null
    }

  # module.git_net_1.netbox_vlan.vlan will be destroyed
  # (because netbox_vlan.vlan is not in configuration)
  - resource "netbox_vlan" "vlan" {
      - id     = "2" -> null
      - name   = "git_net_1" -> null
      - status = "active" -> null
      - tags   = [] -> null
      - vid    = 15 -> null
    }

  # module.git_net_2.aci_application_epg.github_project will be destroyed
  # (because aci_application_epg.github_project is not in configuration)
  - resource "aci_application_epg" "github_project" {
      - annotation             = "tag_epg" -> null
      - application_profile_dn = "uni/tn-github_project/ap-git_net_2_ap" -> null
      - description            = "EPG for git_net_2" -> null
      - exception_tag          = "0" -> null
      - flood_on_encap         = "disabled" -> null
      - fwd_ctrl               = "none" -> null
      - has_mcast_source       = "no" -> null
      - id                     = "uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg" -> null
      - is_attr_based_epg      = "no" -> null
      - match_t                = "AtleastOne" -> null
      - name                   = "git_net_2_epg" -> null
      - pc_enf_pref            = "unenforced" -> null
      - pref_gr_memb           = "exclude" -> null
      - prio                   = "unspecified" -> null
      - relation_fv_rs_bd      = "uni/tn-github_project/BD-vlan_16_bd" -> null
      - shutdown               = "no" -> null
    }

  # module.git_net_2.aci_application_profile.github_project will be destroyed
  # (because aci_application_profile.github_project is not in configuration)
  - resource "aci_application_profile" "github_project" {
      - annotation  = "orchestrator:terraform" -> null
      - description = "git_net_2 ap" -> null
      - id          = "uni/tn-github_project/ap-git_net_2_ap" -> null
      - name        = "git_net_2_ap" -> null
      - prio        = "unspecified" -> null
      - tenant_dn   = "uni/tn-github_project" -> null
    }

  # module.git_net_2.aci_bridge_domain.github_project will be destroyed
  # (because aci_bridge_domain.github_project is not in configuration)
  - resource "aci_bridge_domain" "github_project" {
      - annotation                  = "tag_bd" -> null
      - arp_flood                   = "yes" -> null
      - bridge_domain_type          = "regular" -> null
      - description                 = "Bridge Domain for git_net_2" -> null
      - ep_clear                    = "no" -> null
      - ep_move_detect_mode         = "disable" -> null
      - host_based_routing          = "no" -> null
      - id                          = "uni/tn-github_project/BD-vlan_16_bd" -> null
      - intersite_bum_traffic_allow = "yes" -> null
      - intersite_l2_stretch        = "yes" -> null
      - ip_learning                 = "yes" -> null
      - ipv6_mcast_allow            = "no" -> null
      - limit_ip_learn_to_subnets   = "yes" -> null
      - ll_addr                     = "::" -> null
      - mac                         = "00:22:BD:F8:19:FF" -> null
      - mcast_allow                 = "no" -> null
      - multi_dst_pkt_act           = "bd-flood" -> null
      - name                        = "vlan_16_bd" -> null
      - optimize_wan_bandwidth      = "no" -> null
      - relation_fv_rs_ctx          = "uni/tn-github_project/ctx-github_project" -> null
      - tenant_dn                   = "uni/tn-github_project" -> null
      - unicast_route               = "yes" -> null
      - unk_mac_ucast_act           = "proxy" -> null
      - unk_mcast_act               = "flood" -> null
      - v6unk_mcast_act             = "flood" -> null
      - vmac                        = "not-applicable" -> null
    }

  # module.git_net_2.aci_epg_to_domain.net_2_domain will be destroyed
  # (because aci_epg_to_domain.net_2_domain is not in configuration)
  - resource "aci_epg_to_domain" "net_2_domain" {
      - allow_micro_seg       = false -> null
      - annotation            = "orchestrator:terraform" -> null
      - application_epg_dn    = "uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg" -> null
      - binding_type          = "none" -> null
      - encap                 = "unknown" -> null
      - encap_mode            = "auto" -> null
      - epg_cos               = "Cos0" -> null
      - epg_cos_pref          = "disabled" -> null
      - id                    = "uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg/rsdomAtt-[uni/phys-github_project]" -> null
      - instr_imedcy          = "lazy" -> null
      - netflow_dir           = "both" -> null
      - netflow_pref          = "disabled" -> null
      - num_ports             = "0" -> null
      - port_allocation       = "none" -> null
      - primary_encap         = "unknown" -> null
      - primary_encap_inner   = "unknown" -> null
      - res_imedcy            = "lazy" -> null
      - secondary_encap_inner = "unknown" -> null
      - switching_mode        = "native" -> null
      - tdn                   = "uni/phys-github_project" -> null
      - vmm_id                = jsonencode({}) -> null
    }

  # module.git_net_2.aci_epgs_using_function.epg_to_aep_assign will be destroyed
  # (because aci_epgs_using_function.epg_to_aep_assign is not in configuration)
  - resource "aci_epgs_using_function" "epg_to_aep_assign" {
      - access_generic_dn = "uni/infra/attentp-github_project/gen-default" -> null
      - annotation        = "orchestrator:terraform" -> null
      - encap             = "vlan-16" -> null
      - id                = "uni/infra/attentp-github_project/gen-default/rsfuncToEpg-[uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg]" -> null
      - instr_imedcy      = "lazy" -> null
      - mode              = "regular" -> null
      - primary_encap     = "unknown" -> null
      - tdn               = "uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg" -> null
    }

  # module.git_net_2.aci_subnet.subnet will be destroyed
  # (because aci_subnet.subnet is not in configuration)
  - resource "aci_subnet" "subnet" {
      - annotation  = "orchestrator:terraform" -> null
      - ctrl        = [
          - "nd",
        ] -> null
      - description = "This subnet is created by terraform" -> null
      - id          = "uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg/subnet-[192.168.16.1/24]" -> null
      - ip          = "192.168.16.1/24" -> null
      - parent_dn   = "uni/tn-github_project/ap-git_net_2_ap/epg-git_net_2_epg" -> null
      - preferred   = "no" -> null
      - scope       = [
          - "public",
          - "shared",
        ] -> null
      - virtual     = "no" -> null
    }

  # module.git_net_2.fmc_network_objects.aci_net will be destroyed
  # (because fmc_network_objects.aci_net is not in configuration)
  - resource "fmc_network_objects" "aci_net" {
      - description = " " -> null
      - id          = "005056BF-7B88-0ed3-0000-012886512707" -> null
      - name        = "git_net_2" -> null
      - type        = "Network" -> null
      - value       = "192.168.16.0/24" -> null
    }

  # module.git_net_2.netbox_prefix.prefix will be destroyed
  # (because netbox_prefix.prefix is not in configuration)
  - resource "netbox_prefix" "prefix" {
      - id            = "2" -> null
      - is_pool       = false -> null
      - mark_utilized = false -> null
      - prefix        = "192.168.16.0/24" -> null
      - role_id       = 0 -> null
      - site_id       = 0 -> null
      - status        = "active" -> null
      - tags          = [] -> null
      - tenant_id     = 0 -> null
      - vlan_id       = 3 -> null
      - vrf_id        = 0 -> null
    }

  # module.git_net_2.netbox_vlan.vlan will be destroyed
  # (because netbox_vlan.vlan is not in configuration)
  - resource "netbox_vlan" "vlan" {
      - id     = "3" -> null
      - name   = "git_net_2" -> null
      - status = "active" -> null
      - tags   = [] -> null
      - vid    = 16 -> null
    }

  # module.tenant_policies.aci_any.vzany will be created
  + resource "aci_any" "vzany" {
      + annotation                 = "orchestrator:terraform"
      + description                = (known after apply)
      + id                         = (known after apply)
      + match_t                    = "AtleastOne"
      + name_alias                 = (known after apply)
      + pref_gr_memb               = "disabled"
      + relation_vz_rs_any_to_cons = (known after apply)
      + relation_vz_rs_any_to_prov = (known after apply)
      + vrf_dn                     = (known after apply)
    }

  # module.tenant_policies.aci_contract.est will be created
  + resource "aci_contract" "est" {
      + annotation       = "orchestrator:terraform"
      + description      = (known after apply)
      + filter_entry_ids = (known after apply)
      + filter_ids       = (known after apply)
      + id               = (known after apply)
      + name             = "Established"
      + name_alias       = (known after apply)
      + prio             = (known after apply)
      + scope            = "context"
      + target_dscp      = (known after apply)
      + tenant_dn        = "uni/tn-common"

      + filter {
          + annotation  = (known after apply)
          + description = (known after apply)
          + filter_name = (known after apply)
          + id          = (known after apply)
          + name_alias  = (known after apply)

          + filter_entry {
              + annotation        = (known after apply)
              + apply_to_frag     = (known after apply)
              + arp_opc           = (known after apply)
              + d_from_port       = (known after apply)
              + d_to_port         = (known after apply)
              + description       = (known after apply)
              + entry_annotation  = (known after apply)
              + entry_description = (known after apply)
              + entry_name_alias  = (known after apply)
              + ether_t           = (known after apply)
              + filter_entry_name = (known after apply)
              + icmpv4_t          = (known after apply)
              + icmpv6_t          = (known after apply)
              + id                = (known after apply)
              + match_dscp        = (known after apply)
              + prot              = (known after apply)
              + s_from_port       = (known after apply)
              + s_to_port         = (known after apply)
              + stateful          = (known after apply)
              + tcp_rules         = (known after apply)
            }
        }
    }

  # module.tenant_policies.aci_contract_subject.est will be created
  + resource "aci_contract_subject" "est" {
      + annotation                    = "orchestrator:terraform"
      + apply_both_directions         = "yes"
      + cons_match_t                  = (known after apply)
      + contract_dn                   = (known after apply)
      + description                   = (known after apply)
      + id                            = (known after apply)
      + name                          = "est_subj"
      + name_alias                    = (known after apply)
      + prio                          = (known after apply)
      + prov_match_t                  = (known after apply)
      + relation_vz_rs_sdwan_pol      = (known after apply)
      + relation_vz_rs_subj_filt_att  = (known after apply)
      + relation_vz_rs_subj_graph_att = (known after apply)
      + rev_flt_ports                 = "yes"
      + target_dscp                   = (known after apply)
    }

  # module.tenant_policies.aci_contract_subject_filter.est will be created
  + resource "aci_contract_subject_filter" "est" {
      + action              = "permit"
      + annotation          = "orchestrator:terraform"
      + contract_subject_dn = (known after apply)
      + description         = (known after apply)
      + directives          = (known after apply)
      + filter_dn           = (known after apply)
      + id                  = (known after apply)
      + priority_override   = "default"
    }

  # module.tenant_policies.aci_filter.est will be created
  + resource "aci_filter" "est" {
      + annotation                     = "orchestrator:terraform"
      + description                    = (known after apply)
      + id                             = (known after apply)
      + name                           = "est"
      + name_alias                     = (known after apply)
      + relation_vz_rs_filt_graph_att  = (known after apply)
      + relation_vz_rs_fwd_r_flt_p_att = (known after apply)
      + relation_vz_rs_rev_r_flt_p_att = (known after apply)
      + tenant_dn                      = "uni/tn-common"
    }

  # module.tenant_policies.aci_filter_entry.est will be created
  + resource "aci_filter_entry" "est" {
      + annotation    = "orchestrator:terraform"
      + apply_to_frag = (known after apply)
      + arp_opc       = (known after apply)
      + d_from_port   = "unspecified"
      + d_to_port     = "unspecified"
      + description   = (known after apply)
      + ether_t       = "ip"
      + filter_dn     = (known after apply)
      + icmpv4_t      = (known after apply)
      + icmpv6_t      = (known after apply)
      + id            = (known after apply)
      + match_dscp    = (known after apply)
      + name          = "est"
      + name_alias    = (known after apply)
      + prot          = "tcp"
      + s_from_port   = (known after apply)
      + s_to_port     = (known after apply)
      + stateful      = "no"
      + tcp_rules     = [
          + "est",
        ]
    }

  # module.tenant_policies.aci_tenant.devvie will be created
  + resource "aci_tenant" "devvie" {
      + annotation                    = "orchestrator:terraform"
      + description                   = "Tenant for Devvie"
      + id                            = (known after apply)
      + name                          = "devvie"
      + name_alias                    = (known after apply)
      + relation_fv_rs_tenant_mon_pol = (known after apply)
    }

  # module.tenant_policies.aci_vrf.common will be created
  + resource "aci_vrf" "common" {
      + annotation                              = "orchestrator:terraform"
      + bd_enforced_enable                      = (known after apply)
      + description                             = (known after apply)
      + id                                      = (known after apply)
      + ip_data_plane_learning                  = (known after apply)
      + knw_mcast_act                           = (known after apply)
      + name                                    = "common"
      + name_alias                              = (known after apply)
      + pc_enf_dir                              = (known after apply)
      + pc_enf_pref                             = (known after apply)
      + relation_fv_rs_bgp_ctx_pol              = (known after apply)
      + relation_fv_rs_ctx_to_ep_ret            = (known after apply)
      + relation_fv_rs_ctx_to_ext_route_tag_pol = (known after apply)
      + relation_fv_rs_ospf_ctx_pol             = (known after apply)
      + relation_fv_rs_vrf_validation_pol       = (known after apply)
      + tenant_dn                               = "uni/tn-common"
    }

  # module.tenant_policies.aci_vrf.devvie will be created
  + resource "aci_vrf" "devvie" {
      + annotation                              = "orchestrator:terraform"
      + bd_enforced_enable                      = (known after apply)
      + description                             = "VRF for Devvie"
      + id                                      = (known after apply)
      + ip_data_plane_learning                  = (known after apply)
      + knw_mcast_act                           = (known after apply)
      + name                                    = "devvie"
      + name_alias                              = (known after apply)
      + pc_enf_dir                              = (known after apply)
      + pc_enf_pref                             = (known after apply)
      + relation_fv_rs_bgp_ctx_pol              = (known after apply)
      + relation_fv_rs_ctx_to_ep_ret            = (known after apply)
      + relation_fv_rs_ctx_to_ext_route_tag_pol = (known after apply)
      + relation_fv_rs_ospf_ctx_pol             = (known after apply)
      + relation_fv_rs_vrf_validation_pol       = (known after apply)
      + tenant_dn                               = (known after apply)
    }

Plan: 31 to add, 0 to change, 25 to destroy.

Warning: Possibly unsupported Netbox version

  with provider["registry.terraform.io/e-breuninger/netbox"],
  on main.tf line 13, in provider "netbox":
  13: provider "netbox" {

Your Netbox version is v3.7.5. The provider was successfully tested against
the following versions:

  3.7.0

Unexpected errors may occur.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.tfplan"

```

</details>

*Pushed by: @kozhabergenova, Action: `pull_request`*